Rainchus/marioparty4/src/REL/m409Dll/main.c
    object->data = HuMemDirectMallocNum(HEAP_SYSTEM, 6, 0x10000000);
    var_r29 = (s16*)object->data;
    var_r29[0] = 1;
    var_r30 = HuSprAnimRead(HuDataReadNum(0x28000D, 0x10000000));
    object->model[0] = fn_1_5A18(var_r30, 0x800, 10.0f, 0x40, 0x40);
    fn_1_5FBC(object->model[0], fn_1_5408);
    Hu3DModelLayerSet(object->model[0], 5);
    var_r30 = HuSprAnimRead(HuDataReadNum(0x28000E, 0x10000000));
    object->model[1] = fn_1_5A18(var_r30, 0x400, 2.0f, 0, 0);
    fn_1_5FBC(object->model[1], fn_1_55E0);
    fn_1_5FF4(object->model[1], 1);
    Hu3DModelLayerSet(object->model[1], 5);
    HuAudFXListnerSetEX(&Hu3DCamera->pos, &Hu3DCamera->up, 10000.0f, 566.6667f, 0.0f, 300.0f, 300.0f);
    object->func = fn_1_F70;
}

void fn_1_F70(omObjData* object) {
    s16* sp8;
    s16 temp_r3;
    s16 temp_r3_2;
    s32 var_r31;

    sp8 = (s16*)object->data;
    switch (fn_1_2454(7)) {
        case 1:
            if (lbl_1_bss_6 == 0) {
                lbl_1_bss_6 = 1;
                WipeCreate(1, 0, 0x3C);
            }
            if (WipeStatGet() == 0) {
                fn_1_2414(7, 2);
                
                for (var_r31 = 0; var_r31 < 4; var_r31++) {
                    omVibrate(var_r31, 0xC8, 6, 6);
                }
            }
            break;
        case 2:
            if (fn_1_10E8(object) != 0) {
                fn_1_2414(7, 3);
            }
            break;
        case 3:
            switch (fn_1_2454(0x60)) {
                case 0x40:
                    break;
                case 0x20:
                    fn_1_2098(object);
                    break;
            }
            break;
        case 4:
            if (fn_1_1B74(object) != 0) {
                fn_1_2414(7, 5);
                return;
            }
            break;
        case 5:
            lbl_1_bss_0 = 1;
            break;
    }
}

s8 fn_1_10E8(omObjData* object) {
    Vec sp8;
    ModelData* temp_r31;
    f32 var_f26;
    f32 var_f27;
    f32 temp_f29;
    f32 temp_f28;
    f32 temp_f30;
    f32 var_f31;
    s8 var_r29;
    unkStruct3* temp_r30;

    temp_r31 = &Hu3DData[lbl_1_bss_DC->model[4]];
    temp_r30 = (unkStruct3*)object->data;
    if (lbl_1_bss_A != 0) {
        var_r29 = fn_1_524();
    }
    switch (lbl_1_bss_8) {                    /* irregular */
        case -1:
            if ((HuPadBtnDown[0] & 0x100) != 0) {
                lbl_1_bss_8 = 0;
            }
            break;
        case 0:
            Hu3DModelAttrReset(lbl_1_bss_DC->model[1], 0x40000002);
            if (lbl_1_bss_C == 0.0f) {
                fn_1_3840();
                sp8.x = 1520.0f;
                sp8.y = 0.0f;
                sp8.z = -1200.0f;
                lbl_1_data_BC = HuAudFXEmiterPlay(0x554, &sp8);
                HuAudFXEmiterPlay(0x559, &sp8);
            }
            lbl_1_bss_C += 0.004f;
            if (lbl_1_bss_C >= 1.0f) {
                lbl_1_bss_C = 1.0f;
                lbl_1_bss_8 = 0x63;
            } else if (lbl_1_bss_C > 0.2f) {
                lbl_1_bss_A = 1;
            }
            var_f31 = sin((M_PI * (90.0f * lbl_1_bss_C)) / 180.0);
            var_f27 = 1520.0f;
            var_f26 = -1030.0f;
            temp_f30 = var_f27 + (var_f31 * (var_f26 - var_f27));
            Hu3DModelPosSet(lbl_1_bss_DC->model[4], temp_f30, 0.0f, -1200.0f);
            Hu3DModelPosSet(lbl_1_bss_DC->model[1], temp_f30, 0.0f, -1200.0f);
            if ((lbl_1_data_BC + 0x10000) != 0xFFFF) {
                sp8.x = temp_f30;
                sp8.y = 0.0f;
                sp8.z = -1200.0f;
                HuAudFXEmiterUpDate(lbl_1_data_BC, &sp8);
            }
            var_f31 = 1.2f * lbl_1_bss_C;
            if ((var_f31 >= 1.0f) && ((lbl_1_data_BC + 0x10000) != 0xFFFF)) {
                HuAudFXEmiterPlay(0x555, &sp8);
                sp8.x += 200.0f;
                HuAudFXEmiterPlay(0x55E, &sp8);
                HuAudFXStop(lbl_1_data_BC);
                lbl_1_data_BC = -1;
            }
            if (var_f31 >= 1.0f) {
                var_f31 = 0.0f;
            } else {
                var_f31 = sin((M_PI * (90.0f + (90.0f * var_f31))) / 180.0);
            }
            Hu3DMotionSpeedSet(lbl_1_bss_DC->model[4], 2.0f * var_f31);
            if (lbl_1_bss_C > 0.5f) {
                var_f31 = 2.0f * (9.0f * (1.0f - lbl_1_bss_C));
            } else {
                var_f31 = 9.0f;
            }
            fn_1_44F0(lbl_1_bss_E0->model[0], 0.0f, 0.0f, 0.0f, 0, var_f31);
            if ((lbl_1_bss_C > 0.7f) && (lbl_1_bss_C < 0.9f)) {
                var_f31 = (lbl_1_bss_C - 3.5f);
                if (++lbl_1_bss_10 > (var_f31 * 10.0f)) {
                    lbl_1_bss_10 = 0.0f;
                    temp_f30 = 190.0f + temp_r31->pos.x;
                    temp_f29 = 20.0f + temp_r31->pos.y;
                    temp_f28 = 95.0f + temp_r31->pos.z;
                    var_f31 = 1.0f - (lbl_1_bss_C - 3.5f);
                    fn_1_4FFC(lbl_1_bss_E0->model[1], temp_f30, temp_f29, temp_f28, (u8)(2.0f * var_f31));
                    temp_f30 = 370.0f + temp_r31->pos.x;
                    fn_1_4FFC(lbl_1_bss_E0->model[1], temp_f30, temp_f29, temp_f28, (u8)var_f31);
                    temp_f30 = 490.0f + temp_r31->pos.x;
                    fn_1_4FFC(lbl_1_bss_E0->model[1], temp_f30, temp_f29, temp_f28, (u8)var_f31);
                }
            }
            if (++lbl_1_bss_14 > 1) {
                lbl_1_bss_14 = 0;
                fn_1_44F0(lbl_1_bss_E0->model[0], 190.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z + 95.0f, 1, 1);
                fn_1_44F0(lbl_1_bss_E0->model[0], 370.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z + 95.0f, 1, 1);
                fn_1_44F0(lbl_1_bss_E0->model[0], 490.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z + 95.0f, 1, 1);
                fn_1_44F0(lbl_1_bss_E0->model[0], 190.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z - 95.0f, 1, 1);
                fn_1_44F0(lbl_1_bss_E0->model[0], 370.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z - 95.0f, 1, 1);
                fn_1_44F0(lbl_1_bss_E0->model[0], 490.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z - 95.0f, 1, 1);
            }
            break;
        case 99:
            if (var_r29 == 0) {
                return 0;
            }
            temp_r30->unk2 = MGSeqCreate(3, 0);
            MGSeqPosSet(temp_r30->unk2, 320.0f, 240.0f);
            lbl_1_bss_8 = 0x270F;
            break;
        default:
            if (MGSeqStatGet(temp_r30->unk2) == 0) {
                lbl_1_bss_8 = 0;
                return 1;
            }
            if ((lbl_1_data_C0 == -1) && ((MGSeqStatGet(temp_r30->unk2) & 0x10) != 0)) {
                lbl_1_data_C0 = HuAudSeqPlay(0x48);
            }
            break;
    }
    return 0;
}

s8 fn_1_1B74(omObjData* object) {
    f32 temp_f30;
    f32 temp_f31;
    s16 temp_r27;
    s32 temp_r28;
    unkStruct4* temp_r30;

    temp_r30 = (unkStruct4*)object->data;
    switch (lbl_1_bss_8) {
        case 0:
            temp_r30->unk2 = MGSeqCreate(3, 1);
            MGSeqPosSet(temp_r30->unk2, 320.0f, 240.0f);
            HuAudSeqFadeOut(lbl_1_data_C0, 0x64);
            lbl_1_bss_16 = 0;
            lbl_1_bss_8 = 1;
            break;
        case 1:
            if (++lbl_1_bss_16 > 30) {
                lbl_1_bss_8 = 2;
            }
            break;
        case 2:
            if (fn_1_B80()) {
                lbl_1_bss_8 = 3;
            }
            break;
        case 3:
            fn_1_2414(0x80, 0x80);
            if (temp_r30->unk4 >= 0) {
                GWPlayerCoinWinAdd(temp_r30->unk4, 10);
                temp_r30->unk2 = MGSeqCreate(5, 3, GWPlayerCfg[temp_r30->unk4].character, -1, -1, -1);
                HuAudSStreamPlay(1);
            } else {
                temp_r30->unk2 = MGSeqCreate(3, 2);
                HuAudSStreamPlay(4);
            }
            MGSeqPosSet(temp_r30->unk2, 320.0f, 240.0f);
            lbl_1_bss_8 = 4;
            lbl_1_bss_16 = 0;
            break;
        case 4:
            lbl_1_bss_16++;
            if (MGSeqStatGet(temp_r30->unk2) == 0) {
                lbl_1_bss_8 = 5;
            }
            break;
        case 5:
            lbl_1_bss_16++;
            if (lbl_1_bss_16 > 210.0f) {
                return 1;
            }
            break;
    }
    return 0;
}

void fn_1_2098(omObjData* object) {
    ModelData* temp_r31;
    f32 var_f28;
    f32 var_f29;
    f32 var_f31;
    f32 var_f30;
    s32 var_r30;

    temp_r31 = &Hu3DData[lbl_1_bss_DC->model[4]];
    if (fn_1_2454(0x18) != 0x18) {
        lbl_1_bss_18 += 0.008f;
        if (lbl_1_bss_18 >= 1.0f) {
            fn_1_2414(0x60, 0x40);
            Hu3DModelAttrSet(lbl_1_bss_DC->model[4], 1U);
            lbl_1_bss_18 = 1.0f;
        }
        var_f31 = sin((M_PI * (90.0f * lbl_1_bss_18)) / 180.0);
        var_f29 = -1030.0f;
        var_f28 = -1880.0f;
        var_f30 = var_f29 + (var_f31 * (var_f28 - var_f29));
        Hu3DModelPosSet(lbl_1_bss_DC->model[4], var_f30, 0.0f, -1200.0f);
        Hu3DMotionSpeedSet(lbl_1_bss_DC->model[4], 3.0f * var_f31);
        var_f31 = (4.0f * (9.0f * lbl_1_bss_18));
        fn_1_44F0(lbl_1_bss_E0->model[0], 0.0f, 0.0f, 0.0f, 0, var_f31);
        fn_1_44F0(lbl_1_bss_E0->model[0], 190.0f + var_f30, 15.0f, 95.0f + temp_r31->pos.z, 1, 1);
        fn_1_44F0(lbl_1_bss_E0->model[0], 370.0f + var_f30, 15.0f, 95.0f + temp_r31->pos.z, 1, 1);
        fn_1_44F0(lbl_1_bss_E0->model[0], 490.0f + var_f30, 15.0f, 95.0f + temp_r31->pos.z, 1, 1);
    }
}

void fn_1_23EC(s16 arg0) {
    unkStruct4* var_r31;

    var_r31 = (unkStruct4*)lbl_1_bss_E0->data;
    var_r31->unk4 = arg0;
}

void fn_1_2414(u16 arg0, u16 arg1) {
    unkStruct4* var_r31;

    var_r31 = (unkStruct4*)lbl_1_bss_E0->data;
    var_r31->unk0 &= ~arg0;
    var_r31->unk0 |= arg1;
}

u16 fn_1_2454(u16 arg0) {
    unkStruct4* var_r31;

    var_r31 = (unkStruct4*)lbl_1_bss_E0->data;
    return var_r31->unk0 & arg0;
}

static inline void unkInline(unkStruct4* var_r31, s16 var_r29, s16* var_r28, s16 arg3) {
    var_r31[var_r29].unk2 = Hu3DModelCreateFile(0x280002);
    var_r31[var_r29].unk4 = Hu3DModelCreateFile(0x280003);
    Hu3DModelAttrSet(var_r31[var_r29].unk2, 0x40000001);
    Hu3DModelAttrSet(var_r31[var_r29].unk4, 0x40000002);
    if (arg3) {
        Hu3DModelAttrSet(var_r31[var_r29].unk2, 0x00000001);
        Hu3DModelAttrSet(var_r31[var_r29].unk4, 0x00000001);
    }
    var_r31[var_r29].unk6 = Hu3DModelCreateFile(0x2001C);
    var_r31[var_r29].unk8 = Hu3DJointMotion(var_r31[var_r29].unk6, HuDataSelHeapReadNum(0x28000B, 0x10000000, HEAP_DATA));
    var_r31[var_r29].unkA = Hu3DJointMotion(var_r31[var_r29].unk6, HuDataSelHeapReadNum(0x28000C, 0x10000000, HEAP_DATA));
    Hu3DModelAttrSet(var_r31[var_r29].unk6, 0x40000001);
    Hu3DMotionSet(var_r31[var_r29].unk6, var_r31[var_r29].unk8);
    var_r31[var_r29].unkC = var_r29 + 3;
    if (arg3) {
        *var_r28 += (((rand8() << 8) | rand8()) % 4) + 2;
    } else {
        *var_r28 = 2;
    }
    fn_1_3988(&var_r31[var_r29], *var_r28, var_r29);
    Hu3DModelPosSet(var_r31[var_r29].unk2, var_r31[var_r29].unk18, 0.0f, -1200.0f);
    Hu3DModelPosSet(var_r31[var_r29].unk4, var_r31[var_r29].unk18, 0.0f, -1200.0f);
}

void fn_1_2484(omObjData* object) {
    s16 var_r28;
    s16 var_r29;
    unkStruct4* var_r31;
    s32 temp_r27;

    var_r31 = &lbl_1_bss_40[0];
    object->stat |= 0x100;
    object->model[0] = Hu3DModelCreateFile(0x280000);
    object->model[5] = Hu3DModelCreateFile(0x280008);
    Hu3DModelLayerSet(object->model[0], 2);
    Hu3DModelLayerSet(object->model[5], 2);
    object->model[2] = Hu3DModelCreateFile(0x280005);
    object->model[3] = Hu3DModelCreateFile(0x280006);
    Hu3DModelScaleSet(object->model[2], 1.1f, 1.0f, 1.0f);
    Hu3DModelScaleSet(object->model[3], 1.1f, 1.0f, 1.0f);
    Hu3DModelRotSet(object->model[2], 0.2f * lbl_1_data_4C->rot.x, 0.85f * lbl_1_data_4C->rot.y, 0.0f);
    Hu3DModelRotSet(object->model[3], 0.2f * lbl_1_data_4C->rot.x, 0.85f * lbl_1_data_4C->rot.y, 0.0f);
    Hu3DModelLayerSet(object->model[2], 2);
    Hu3DModelLayerSet(object->model[3], 2);
    lbl_1_bss_24.unkE = Hu3DTexScrollCreate(object->model[2], "cr_kumo2");
    Hu3DTexScrollPosMoveSet(lbl_1_bss_24.unkE, -0.0002f, 0.0f, 0.0f);
    lbl_1_bss_24.unk10 = Hu3DTexScrollCreate(object->model[3], "cr_kumo3");
    Hu3DTexScrollPosMoveSet(lbl_1_bss_24.unk10, -0.0003f, 0.0f, 0.0f);
    var_r29 = Hu3DModelCreateFile(0x28000A);
    Hu3DModelLayerSet(var_r29, 0);
    object->model[6] = Hu3DModelCreateFile(0x280007);
    Hu3DModelAttrSet(object->model[6], 2);
    Hu3DModelScaleSet(object->model[6], 1.1f, 1.0f, 1.0f);
    Hu3DModelRotSet(object->model[6], 0.2f * lbl_1_data_4C->rot.x, 0.85f * lbl_1_data_4C->rot.y, 0.0f);
    Hu3DModelLayerSet(object->model[6], 1);
    lbl_1_bss_24.unk12 = Hu3DTexScrollCreate(object->model[6], "bg");
    lbl_1_bss_24.unk14 = 0.0f;
    object->model[4] = Hu3DModelCreateFile(0x280001);
    object->model[1] = Hu3DModelCreateFile(0x280004);
    Hu3DModelAttrSet(object->model[4], 0x40000001);
    Hu3DModelPosSet(object->model[4], 1660.0f, 0.0f, -1200.0f);
    Hu3DModelPosSet(object->model[1], 1660.0f, 0.0f, -1200.0f);
    Hu3DModelLayerSet(object->model[1], 6);
    Hu3DModelAttrSet(object->model[1], 0x40000002);
    
    unkInline(var_r31, 0, &var_r28, 0);
    for (var_r29 = 1; var_r29 < 4; var_r29++) {
        unkInline(var_r31, var_r29, &var_r28, 1);
    }
    
