Rainchus/marioparty4/src/REL/m409Dll/main.c
    lbl_1_bss_24.unk0 = 0;
    lbl_1_bss_24.unk1 = 0;
    lbl_1_bss_24.unk8 = 0;
    lbl_1_bss_24.unkA = 0xB4;
    Hu3DModelShadowMapSet(object->model[0]);
    Hu3DModelShadowSet(object->model[4]);
    
    for (var_r29 = 0; var_r29 < 4; var_r29++) {
        Hu3DModelShadowSet(var_r31[var_r29].unk2);
        Hu3DModelShadowSet(var_r31[var_r29].unk4);
    }
    lbl_1_bss_3C = 0;
    object->func = fn_1_2DCC;
}

void fn_1_2DCC(omObjData* object) {
    u16 spE;
    u16 spC;
    u16 spA;
    u16 sp8;
    ModelData* temp_r30;
    f32 temp_f29;
    f32 var_f31;
    f32 var_f30;
    s16 var_r22;
    s16 var_r23;
    s16 var_r28;
    s16 var_r27;
    s16 var_r29;
    s32 temp_r16;
    s16 var_r18;
    unkStruct4* var_r31;

    if ((lbl_1_bss_24.unk0 == 0) || (fn_1_2454(0x18) == 0x18)) {
        if (lbl_1_bss_24.unk1 != 0) {
            var_r31 = lbl_1_bss_24.unk4;
            switch (lbl_1_bss_24.unk1) {
                case 1:
                    if (++lbl_1_bss_24.unk8 == (lbl_1_bss_24.unkA - 5)) {
                        Hu3DMotionSet(var_r31->unk6, var_r31->unkA);
                        Hu3DModelAttrReset(var_r31->unk6, 0x40000001);
                        lbl_1_bss_3C++;
                        break;
                    }
                    if (lbl_1_bss_24.unk8 > lbl_1_bss_24.unkA) {
                        lbl_1_bss_24.unk8 = 0;
                        lbl_1_bss_24.unkA = 0xF;
                        Hu3DModelAttrReset(var_r31->unk4, 0x40000002);
                        lbl_1_bss_24.unk1 = 2;
                        HuAudFXPlay(0x55B);
                        HuAudFXPlay(0x55D);
                    }
                break;
            case 2:
                temp_f29 = Hu3DMotionMaxTimeGet(var_r31->unk4);
                if (Hu3DMotionTimeGet(var_r31->unk4) >= temp_f29) {
                    Hu3DMotionSet(var_r31->unk6, var_r31->unk8);
                    Hu3DModelAttrSet(var_r31->unk6, 0x40000001);
                    Hu3DModelAttrSet(var_r31->unk4, 0x40000002);
                    fn_1_2414(24, 8);
                    lbl_1_bss_24.unk1 = 0;
                }
                break;
            }
        } else {
            var_r31 = lbl_1_bss_24.unk4;
            switch (fn_1_2454(0x18)) {
                case 16:
                    Hu3DMotionSet(var_r31->unk6, var_r31->unkA);
                    Hu3DMotionTimeSet(var_r31->unk6, Hu3DMotionMaxTimeGet(var_r31->unk6));
                    Hu3DMotionSpeedSet(var_r31->unk6, -1.0f);
                    Hu3DModelAttrReset(var_r31->unk6, 0x40000001);
                    Hu3DMotionSpeedSet(var_r31->unk4, -1.0f);
                    Hu3DModelAttrReset(var_r31->unk4, 0x40000002);
                    fn_1_2414(24, 0x18);
                    HuAudFXPlay(0x55C);
                    HuAudFXPlay(0x55D);
                    break;
                case 24:
                    if (Hu3DMotionTimeGet(var_r31->unk4) <= 0.0f) {
                        Hu3DMotionSet(var_r31->unk6, var_r31->unk8);
                        Hu3DMotionSpeedSet(var_r31->unk6, 1.0f);
                        Hu3DModelAttrSet(var_r31->unk6, 0x40000001);
                        Hu3DMotionSpeedSet(var_r31->unk4, 1.0f);
                        Hu3DModelAttrSet(var_r31->unk4, 0x40000002);
                        fn_1_2414(24, 0);
                    }
                    break;
            }
        }
    } else {
        if (fn_1_2454(7) == 2) {
            var_f30 = 0.004f;
        } else {
            var_f30 = 0.008f;
        }
        var_r29 = 0;
        var_r23 = 0;
        var_r31 = lbl_1_bss_40;
        
        for (;var_r29 < 4; var_r29++, var_r31++) {
            if ((s8)var_r31->unk0b == 0) {
                var_r23++;
            } else {
                if (var_r31->unkE-- <= 0) {
                    temp_r30 = &Hu3DData[var_r31->unk2];
                    if ((var_r31->unkC < 2) && (lbl_1_bss_3C < 0xBU)) {
                        Hu3DModelAttrReset(var_r31->unk2, 1U);
                        Hu3DModelAttrReset(var_r31->unk4, 1U);
                        Hu3DModelAttrReset(var_r31->unk6, 1U);
                    }
                    var_r31->unk10 += var_f30;
                    var_f31 = sin((M_PI * (90.0f * var_r31->unk10)) / 180.0);
                    if (var_r31->unk10 >= 1.0f) {
                        var_f31 = 1.0f;
                        var_r31->unk10 = var_f31;
                        temp_r30->pos.x = var_r31->unk1C;
                        if (var_r31->unkC == 0) {
                            lbl_1_bss_24.unk4 = var_r31;
                        }
                        var_r27 = var_r31->unkC - 1;
                        if (var_r27 == -3) {
                            Hu3DModelAttrSet(var_r31->unk2, 1);
                            Hu3DModelAttrSet(var_r31->unk4, 1);
                            Hu3DModelAttrSet(var_r31->unk6, 1);
                            var_r31->unkC = 2;
                            var_r27 = 1;
                        }
                        fn_1_3988(var_r31, 0, var_r27);
                    } else {
                        temp_r30->pos.x = var_r31->unk18 + (var_f31 * (var_r31->unk1C - var_r31->unk18));
                    }
                    if (var_f31 > 0.1f) {
                        if (++var_r31->unk16 > 1) {
                            var_r31->unk16 = 0;
                            fn_1_44F0(*lbl_1_bss_E0->model, 130.0f + temp_r30->pos.x, 15.0f, 95.0f + temp_r30->pos.z, 1, 1);
                            fn_1_44F0(*lbl_1_bss_E0->model, 630.0f + temp_r30->pos.x, 15.0f, 95.0f + temp_r30->pos.z, 1, 1);
                        }
                    }
                    if ((var_r31->unk10 > 0.7f) && (var_r31->unk10 < 0.9f)) {
                        var_f31 = var_r31->unk10 - 3.5f;
                        if (++lbl_1_bss_1C > (40.0f * var_f31)) {
                            lbl_1_bss_1C = 0.0f;
                            var_f31 = 1.0f - var_f31;
                            fn_1_4FFC(lbl_1_bss_E0->model[1], 130.0f + temp_r30->pos.x, 20.0f + temp_r30->pos.y, 95.0f + temp_r30->pos.z, (u8)(2.0f * var_f31));
                            fn_1_4FFC(lbl_1_bss_E0->model[1], 630.0f + temp_r30->pos.x, 20.0f + temp_r30->pos.y, 95.0f + temp_r30->pos.z, (u8)var_f31);
                        }
                        if (var_r31->unk10 < (0.7f + var_f30)) {
                            HuAudFXEmiterPlay(0x55E, &temp_r30->pos);
                        }
                    }
                    Hu3DModelPosSet(var_r31->unk6, 70.0f + temp_r30->pos.x, 290.0f, -1200.0f);
                    Hu3DData[var_r31->unk4].pos.x = temp_r30->pos.x;
                    var_f31 = (0.800000011920929 * sin((M_PI * (180.0f * var_r31->unk10)) / 180.0));
                    Hu3DMotionSpeedSet(var_r31->unk2, var_f31);
                }
            }
        }
        if (var_r23 == 4) {
            var_r22 = 0x63;
            lbl_1_bss_24.unk0 = 0;
            
