Rainchus/marioparty4/src/REL/m409Dll/main.c
void fn_1_5408(ModelData* arg0, struct _unkStruct6* arg1, Mtx arg2) {
    s16 var_r29;
    GXColor* var_r30;
    unkStruct5* var_r31;

    var_r29 = 0;
    var_r31 = arg1->unk18;
    var_r30 = arg1->unk24;
    
    for (;var_r29 < arg1->unk0; var_r29++, var_r31++, var_r30++) {
        if (var_r31->unk4E != 0) {
            switch (var_r31->unk2C) {
                case 0:
                    var_r31->unk0.y -= 0.1f;
                    var_r31->unk40.x += var_r31->unk0.x;
                    var_r31->unk40.y += var_r31->unk0.y;
                    var_r31->unk40.z += var_r31->unk0.z;
                    var_r31->unk18 += var_r31->unk1C;
                    if (var_r31->unk18 > 255.0f) {
                        var_r31->unk18 = 255.0f;
                    }
                    var_r30->r = var_r30->g = var_r30->b = var_r31->unk18;
                    break;
                case 1:
                    var_r31->unk40.x += var_r31->unk0.x;
                    var_r31->unk40.z += var_r31->unk0.z;
                    break;
            }
            var_r31->unk20 -= var_r31->unk24;
            if (var_r31->unk20 < 0.0f) {
                var_r31->unk20 = 0.0f;
            }
            var_r30->a = var_r31->unk20;
            var_r31->unk28++;
            if (var_r31->unk28 >= var_r31->unk2A) {
                var_r31->unk28 = 0;
                var_r31->unk4C++;
            }
            if (var_r31->unk4C >= (arg1->unk14 - 2)) {
                var_r31->unk4E = 0;
            }
        }
    }
}

void fn_1_55E0(ModelData* arg0, struct _unkStruct6* arg1, Mtx arg2) {
    GXColor* var_r30;
    f32 var_f31;
    f32 var_f30;
    s16 var_r29;
    s32 var_r28;
    unkStruct5* var_r31;

    var_r29 = 0;
    var_r31 = arg1->unk18;
    var_r30 = arg1->unk24;
    
    for (;var_r29 < arg1->unk0; var_r29++, var_r31++, var_r30++) {
        if (var_r31->unk4E != 0) {
            var_r31->unk0.x -= var_r31->unkC.x;
            var_r31->unk0.y -= 0.2f;
            var_r31->unk0.z -= var_r31->unkC.z;
            if (var_r31->unk0.x < var_r31->unkC.x) {
                var_r31->unk0.x = var_r31->unkC.x;
            }
            if (var_r31->unkC.z < 0.0f) {
                var_f31 = -var_r31->unkC.z;
            } else {
                var_f31 = var_r31->unkC.z;
            }
            if (var_r31->unk0.z < 0.0f) {
                var_f30 = -var_r31->unk0.z;
            } else {
                var_f30 = var_r31->unk0.z;
            }
            if (var_f30 < var_f31) {
                var_r31->unk0.z = var_r31->unkC.z;
            }
            var_r31->unk40.x += var_r31->unk0.x;
            var_r31->unk40.y += var_r31->unk0.y;
            var_r31->unk40.z += var_r31->unk0.z;
            var_r31->unk18 -= var_r31->unk1C;
            if (var_r31->unk18 < 0.0f) {
                var_r31->unk18 = 0.0f;
            }
            if (var_r31->unk18 > 255.0f) {
                var_r28 = 0xFF;
            } else {
                var_r28 = (u8)var_r31->unk18;
            }
            var_r30->a = var_r28;
            if (0.0f == var_r31->unk18) {
                var_r31->unk4E = 0;
            }
        }
    }
}

void fn_1_57DC(ModelData* arg0, struct _unkStruct6* arg1, Mtx arg2) {
    Vec sp18;
    Vec spC;
    GXColor sp8;
    ModelData* temp_r30;
    unkStruct5* temp_r31;

    temp_r30 = &Hu3DData[lbl_1_bss_DC->model[4]];
    temp_r31 = arg1->unk18;
    if (temp_r31->unk4E == 0) {
        spC.x = spC.y = spC.z = 1.0f;
        sp8.r = sp8.g = sp8.b = sp8.a = 0xFF;
        fn_1_58E0(lbl_1_bss_E0->model[2], &sp18, &spC, 0.0f, &sp8);
    }
    temp_r31->unk40.x = (60.0f + temp_r30->pos.x);
    temp_r31->unk40.y = (260.0f + temp_r30->pos.y);
    temp_r31->unk40.z = temp_r30->pos.z;
}

unkStruct5* fn_1_58E0(s16 arg0, Vec* arg1, Vec* arg2, f32 arg3, GXColor* arg4) {
    s16 var_r29;
    unkStruct5* var_r31;
    unkStruct6* temp_r30;
    ModelData* var_r28;

    var_r28 = &Hu3DData[arg0];
    temp_r30 = (unkStruct6*)var_r28->unk_120;
    
    var_r29 = 0;
    var_r31 = temp_r30->unk18;
    for (;var_r29 < temp_r30->unk0; var_r29++, var_r31++) {
        if (var_r31->unk4E == 0) {
            break;
        }
    }
    if (var_r29 == temp_r30->unk0) {
        return NULL;
    }
    temp_r30->unk24[var_r29].r = arg4->r;
    temp_r30->unk24[var_r29].g = arg4->g;
    temp_r30->unk24[var_r29].b = arg4->b;
    temp_r30->unk24[var_r29].a = arg4->a;
    var_r31->unk2E = var_r29;
    var_r31->unk30 = arg3;
    var_r31->unk34 = *arg2;
    var_r31->unk40 = *arg1;
    var_r31->unk4C = 0;
    var_r31->unk4E = 1;
    return var_r31;
}

s16 fn_1_5A18(AnimData* arg0, s16 arg1, f32 arg8, s16 arg2, s16 arg3) {
    ModelData* temp_r28;
    f32 temp_f0;
    s16 var_r21;
    s16 var_r22;
    s16 var_r30;
    s16 var_r20;
    unkStruct6* var_r31;
    void* var_r19;
    void* var_r18;
    unkStruct5* var_r24;
    Vec* var_r25;
    GXColor* var_r27;
    HsfVector2f* var_r29;
    
    var_r21 = Hu3DHookFuncCreate(fn_1_602C);
    temp_r28 = &Hu3DData[var_r21];
    var_r31 = HuMemDirectMallocNum(HEAP_DATA, sizeof(unkStruct6), temp_r28->unk_48);
    temp_r28->unk_120 = var_r31;
    arg0->useNum++;
    var_r31->unk10 = arg0;
    var_r31->unk0 = arg1;
    var_r31->unk8 = 0;
    var_r31->unkC = NULL;
    var_r24 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(unkStruct5), temp_r28->unk_48);
    var_r31->unk18 = var_r24;
    
    for (var_r30 = 0; var_r30 < arg1; var_r30++, var_r24++) {
        var_r24->unk4C = -1;
        var_r24->unk4E = 0;
    }
    var_r25 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(Vec) * 4, temp_r28->unk_48);
    var_r31->unk1C = var_r25;
    
    for (var_r30 = 0; var_r30 < (arg1 * 4); var_r30++, var_r25++) {
        var_r25->x = var_r25->y = var_r25->z = 0.0f;
    }
    var_r27 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(GXColor), temp_r28->unk_48);
    var_r31->unk24 = var_r27;
    
    for (var_r30 = 0; var_r30 < arg1; var_r30++, var_r27++) {
        var_r27->r = var_r27->g = var_r27->b = var_r27->a = 0xFF;
    }
    var_r29 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(HsfVector2f) * 4, temp_r28->unk_48);
    var_r31->unk20 = var_r29;
    
    for (var_r30 = 0; var_r30 < arg1; var_r30++) {
        var_r29->x = 0.0f;
        var_r29->y = 0.0f;
        var_r29++;
        var_r29->x = 1.0f;
        var_r29->y = 0.0f;
        var_r29++;
        var_r29->x = 1.0f;
        var_r29->y = 1.0f;
        var_r29++;
        var_r29->x = 0.0f;
        var_r29->y = 1.0f;
        var_r29++;
    }
    if ((arg2 != 0) || (arg3 != 0)) {
        var_r22 = arg0->bmp->sizeX / arg2;
        var_r20 = arg0->bmp->sizeY / arg3;
        var_r31->unk14 = (var_r22 * var_r20);
        var_r31->unk60 = (1.0f / var_r22);
        var_r31->unk64 = (1.0f / var_r20);
    } else {
        var_r22 = 1;
        var_r31->unk14 = 1;
        var_r31->unk60 = 1.0f;
        var_r31->unk64 = 1.0f;
    }
    var_r31->unk5C = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk14 * sizeof(HsfVector2f), temp_r28->unk_48);
    fn_1_6608(var_r31->unk5C, var_r31->unk14, var_r22, var_r31->unk60, var_r31->unk64);
    var_r31->unk2C.x = var_r31->unk50.x = var_r31->unk44.y = var_r31->unk50.y = -arg8;
    var_r31->unk38.x = var_r31->unk44.x = var_r31->unk2C.y = var_r31->unk38.y = arg8;
    var_r31->unk2C.z = var_r31->unk38.z = var_r31->unk44.z = var_r31->unk50.z = 0.0f;
    var_r19 = var_r18 = HuMemDirectMallocNum(HEAP_DATA, 0x20000, temp_r28->unk_48);
    DCFlushRange(var_r19, 0x20000);
    GXBeginDisplayList(var_r19, 0x20000);
    GXBegin(GX_QUADS, GX_VTXFMT0, (arg1 * 4));
    
    for (var_r30 = 0; var_r30 < arg1; var_r30++) {
        GXPosition1x16(var_r30 * 4);
        GXColor1x16(var_r30);
        GXTexCoord1x16(var_r30 * 4);
        GXPosition1x16((var_r30 * 4) + 1);
        GXColor1x16(var_r30);
        GXTexCoord1x16((var_r30 * 4) + 1);
        GXPosition1x16((var_r30 * 4) + 2);
        GXColor1x16(var_r30);
        GXTexCoord1x16((var_r30 * 4) + 2);
        GXPosition1x16((var_r30 * 4) + 3);
        GXColor1x16(var_r30);
        GXTexCoord1x16((var_r30 * 4) + 3);
    }
    var_r31->unk4 = GXEndDisplayList();
    var_r31->unk28 = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk4, temp_r28->unk_48);
    memcpy(var_r31->unk28, var_r18, var_r31->unk4);
    DCFlushRange(var_r31->unk28, var_r31->unk4);
    HuMemDirectFree(var_r18);
    return var_r21;
}

void fn_1_5F5C(s16 arg0) {
    ModelData* var_r31;
    unkStruct6* var_r30;

