Rainchus/marioparty4/src/REL/m409Dll/main.c
    var_r31 = &Hu3DData[arg0];
    var_r30 = (unkStruct6*)var_r31->unk_120;
    HuSprAnimKill(var_r30->unk10);
    Hu3DModelKill(arg0);
}

void fn_1_5FBC(s16 arg0, m409Func6 arg1) {
    ModelData* var_r31;
    unkStruct6* var_r30;

    var_r31 = &Hu3DData[arg0];
    var_r30 = (unkStruct6*)var_r31->unk_120;
    var_r30->unkC = arg1;
}

void fn_1_5FF4(s16 arg0, u8 arg1) {
    ModelData* var_r31;
    unkStruct6* var_r30;

    var_r31 = &Hu3DData[arg0];
    var_r30 = (unkStruct6*)var_r31->unk_120;
    var_r30->unk8 = arg1;
}

void fn_1_602C(ModelData* arg0, f32 (*arg1)[4]) {
    Mtx sp128;
    ROMtx spF8;
    Mtx spC8;
    Mtx sp98;
    Vec sp68[4];
    Vec sp5C;
    Vec sp50;
    Vec sp44;
    Vec sp38;
    Vec sp2C;
    Vec sp20;
    Vec sp14;
    Vec sp8;
    Vec* var_r31;
    s16 var_r24;
    HsfVector2f* var_r26;
    s16 var_r25;
    unkStruct6* temp_r30;
    unkStruct5* var_r29;
    m409Func6 var_r23;

    temp_r30 = (unkStruct6*)arg0->unk_120;
    GXLoadPosMtxImm(arg1, 0);
    GXSetNumTevStages(1);
    GXSetNumTexGens(1);
    GXSetTexCoordGen2(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, GX_IDENTITY, GX_FALSE, GX_PTIDENTITY);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
    var_r24 = temp_r30->unk10->bmp->dataFmt & 0xF;
    if ((var_r24 == 7) || (var_r24 == 8)) {
        GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_ONE, GX_CC_RASC, GX_CC_ZERO);
    } else {
        GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_TEXC, GX_CC_RASC, GX_CC_ZERO);
    }
    GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_TEXA, GX_CA_RASA, GX_CA_ZERO);
    GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetNumChans(1);
    GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_REG, GX_SRC_VTX, 0, GX_DF_CLAMP, GX_AF_NONE);
    if ((arg0->attr & 2) != 0) {
        GXSetZMode(GX_TRUE, GX_LEQUAL, GX_TRUE);
    } else {
        GXSetZMode(GX_TRUE, GX_LEQUAL, GX_FALSE);
    }
    HuSprTexLoad(temp_r30->unk10, 0, 0, GX_REPEAT, GX_REPEAT, GX_LINEAR);
    GXSetAlphaCompare(GX_GEQUAL, 1, GX_AOP_AND, GX_GEQUAL, 1);
    GXSetZCompLoc(0);
    switch (temp_r30->unk8) {
    case 0:
        GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
        break;
    case 1:
        GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_ONE, GX_LO_NOOP);
        break;
    case 2:
        GXSetBlendMode(GX_BM_BLEND, GX_BL_ZERO, GX_BL_INVDSTCLR, GX_LO_NOOP);
        break;
    }
    GXClearVtxDesc();
    GXSetVtxDesc(GX_VA_POS, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_TEX_ST, GX_RGBA6, 0);
    GXSetArray(GX_VA_POS, temp_r30->unk1C, 0xC);
    GXSetVtxDesc(GX_VA_CLR0, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_CLR0, GX_TEX_ST, GX_RGBA8, 0);
    GXSetArray(GX_VA_CLR0, temp_r30->unk24, 4);
    GXSetVtxDesc(GX_VA_TEX0, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX0, GX_TEX_ST, GX_RGBA6, 0);
    GXSetArray(GX_VA_TEX0, temp_r30->unk20, 8);
    fn_1_40A4(arg1, sp128);
    PSMTXReorder(sp128, spF8);
    if (((u8)omPauseChk() == 0) && (temp_r30->unkC)) {
        var_r23 = temp_r30->unkC;
        var_r23(arg0, temp_r30, arg1);
    }
    var_r29 = temp_r30->unk18;
    var_r31 = temp_r30->unk1C;
    var_r26 = temp_r30->unk20;
    PSMTXROMultVecArray(spF8, &temp_r30->unk2C, &sp68[0], 4);
    
    for (var_r25 = 0; var_r25 < temp_r30->unk0; var_r25++, var_r29++, var_r26+=4) {
        if (var_r29->unk4E == 0) {
            var_r31->x = var_r31->y = var_r31->z = 0.0f;
            var_r31++;
            var_r31->x = var_r31->y = var_r31->z = 0.0f;
            var_r31++;
            var_r31->x = var_r31->y = var_r31->z = 0.0f;
            var_r31++;
            var_r31->x = var_r31->y = var_r31->z = 0.0f;
            var_r31++;
        } else {
            if (var_r29->unk30 == 0.0f) {
                fn_1_6778(&sp68[0], &sp38, &var_r29->unk34, 4);
                PSVECAdd(&sp38, &var_r29->unk40, var_r31++);
                PSVECAdd(&sp44, &var_r29->unk40, var_r31++);
                PSVECAdd(&sp50, &var_r29->unk40, var_r31++);
                PSVECAdd(&sp5C, &var_r29->unk40, var_r31++);
            } else {
                fn_1_6778(&temp_r30->unk2C, &sp38, &var_r29->unk34, 4);
                PSMTXRotRad(spC8, 0x5A, 0.017453292f * var_r29->unk30);
                PSMTXConcat(sp128, spC8, sp98);
                PSMTXMultVecArray(sp98, &sp38, &sp8, 4);
                PSVECAdd(&sp8, &var_r29->unk40, var_r31++);
                PSVECAdd(&sp14, &var_r29->unk40, var_r31++);
                PSVECAdd(&sp20, &var_r29->unk40, var_r31++);
                PSVECAdd(&sp2C, &var_r29->unk40, var_r31++);
            }
            if (var_r29->unk4C != -1) {
                fn_1_66D4(var_r26, temp_r30->unk5C, var_r29->unk4C, temp_r30->unk60, temp_r30->unk64);
            }
        }
    }
    DCFlushRangeNoSync(temp_r30->unk1C, temp_r30->unk0 * 0xC * 4);
    DCFlushRangeNoSync(temp_r30->unk20, temp_r30->unk0 * 8 * 4);
    PPCSync();
    GXCallDisplayList(temp_r30->unk28, temp_r30->unk4);
}

void fn_1_6608(HsfVector2f* arg0, s16 arg1, s16 arg2, f32 arg3, f32 arg4) {
    s16 var_r31;
    s16 var_r30;
    s16 var_r29;
    
    for (var_r31 = 0; var_r31 < arg1; var_r31++, arg0++) {
        var_r30 = (var_r31 % arg2);
        var_r29 = (var_r31 / arg2);
        arg0->x = (var_r30 * arg3);
        arg0->y = (var_r29 * arg4);
    }
}

void fn_1_66D4(HsfVector2f* arg0, HsfVector2f* arg1, s16 arg2, f32 arg3, f32 arg4) {
    arg0[0].x = arg1[arg2].x;
    arg0[0].y = arg1[arg2].y;
    arg0[1].x = (arg3 + arg1[arg2].x);
    arg0[1].y = arg1[arg2].y;
    arg0[2].x = (arg3 + arg1[arg2].x);
    arg0[2].y = (arg4 + arg1[arg2].y);
    arg0[3].x = arg1[arg2].x;
    arg0[3].y = (arg4 + arg1[arg2].y);
}

void fn_1_6778(Vec* arg0, Vec* arg1, Vec* arg2, s16 arg3) {
    s16 var_r31;
    
    for (var_r31 = 0; var_r31 < arg3; var_r31++, arg0++, arg1++) {
        arg1->x = arg0->x * arg2->x;
        arg1->y = arg0->y * arg2->y;
        arg1->z = arg0->z * arg2->z;
    }
}